Revit 2027 API
RebarShapeDefinitionBySegments.NumberOfVertices Property
 The number of vertices in this shape, always equal to NumberOfSegments + 1.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfVertices { get; }
Public ReadOnly Property NumberOfVertices As Integer
	Get
public:
property int NumberOfVertices {
	int get ();
}
member NumberOfVertices : int with get
Property Value
Int32
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace